// visitcount.c  --  Í³¼ÆÉÏÕ¾·Ö²¼Çé¿ö
// Powered by bluetent 2003.01.10 Version 2.0

////////////////////////////
// history:
// 2002.12.11 Version 1.0
//
////////////////////////////

char 	datestring[30];

#include <time.h>
#include <stdio.h>
#include "bbs.h"

void getdatestring( time_t now)
{
        struct tm *tm;
        char weeknum[7][3]={"Ìì","Ò»","¶þ","Èý","ËÄ","Îå","Áù"};

        tm = localtime(&now);
        sprintf(datestring,"%4dÄê%02dÔÂ%02dÈÕ%02d:%02d:%02d ÐÇÆÚ%2s",
                tm->tm_year+1900,tm->tm_mon+1,tm->tm_mday,
                tm->tm_hour,tm->tm_min,tm->tm_sec,
                weeknum[tm->tm_wday]);
}

int main()
{
	FILE   *fp;
	char    buf[256];
	char    date[80];
	int     now;
	int		c[5][2];
	int i;
	for(i=0;i<5;i++)
	{
		c[i][0]=0;
		c[i][1]=0;
	}
	sprintf(buf,"%s/usies", BBSHOME);
	if ((fp = fopen(buf, "r")) == NULL) {
		printf("can't open usies\n");
		return 1;
	}
	now = time(0);
	getdatestring(now);
	sprintf(date, "%14.14s", datestring);
	while (fgets(buf, 256, fp))
	{
		int iswww;
		if(strstr(buf, "ENTER")&&strstr(buf, date))
		{
			iswww=0;
			//È«²¿
			c[0][0]++;
			if(strstr(buf, "[www]"))
			{
				c[0][1]++;
				iswww=1;
			}
			//ËÞÉáÍø
			if(strstr(buf, "@10."))
			{
				c[1][0]++;
				if(iswww)c[1][1]++;
				continue;
			}

			//ÄÏ¿ª´óÑ§½ÌÓýÍø
			int n1 = atoi(buf + 59 - iswww);
			if((!strncmp(buf + 51 - iswww, "202.113.", 8)
			&&((n1 >=16 && n1 <= 31) || (n1 >= 224 && n1 <= 239)))
			|| !strncmp(buf + 51 - iswww, "222.30.", 7))
			{
				if(iswww==1)c[2][1]++;
				c[2][0]++;
				continue;
			}
		}
	}
		fclose(fp);
	
	sprintf(buf,"%s/0Announce/bbslist/visitcount", BBSHOME);
	if ((fp = fopen(buf, "w")) == NULL) {
		printf("Cann't open visitcount\n");
		return 1;
	}

	fprintf(fp, "      ÎÒ°®ÄÏ¿ªBBSÕ¾ÉÏÕ¾IP·Ö²¼Í³¼Æ±í (%s)\n\n",datestring);

	fprintf(fp,"[1;36m¡ñ[1;36mÊýÖµ(ÈË´Î)[1;37m\n");	
	fprintf(fp,"        ©³©¥©¥©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©·\n");
	fprintf(fp,"        ©§   À´    Ô´   ©¦Telnet·½Ê½©¦ WWW ·½Ê½ ©¦  ºÏ  ¼Æ  ©§\n");
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§ÄÏ¿ª´óÑ§ËÞÉáÍø©¦   %5d  ©¦   %5d  ©¦   %5d  ©§\n", c[1][0]-c[1][1],c[1][1],c[1][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§ÄÏ¿ª´óÑ§½ÌÓýÍø©¦   %5d  ©¦   %5d  ©¦   %5d  ©§\n",c[2][0]-c[2][1],c[2][1],c[2][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§Ð£  Íâ  Íø  ¶Î©¦   %5d  ©¦   %5d  ©¦   %5d  ©§\n",(c[0][0]-c[1][0]-c[2][0])-(c[0][1]-c[1][1]-c[2][1]),c[0][1]-c[1][1]-c[2][1],c[0][0]-c[1][0]-c[2][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§   ×Ü    ¼Æ   ©¦   %5d  ©¦   %5d  ©¦   %5d  ©§\n",c[0][0]-c[0][1],c[0][1],c[0][0]);
	fprintf(fp,"        ©»©¥©¥©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©¿\n");

	
	fprintf(fp,"[1;36m¡ñ[1;36m°Ù·Ö±È(ºáÏò)[1;37m\n");
	fprintf(fp,"        ©³©¥©¥©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©·\n");
	fprintf(fp,"        ©§   À´    Ô´   ©¦Telnet·½Ê½©¦ WWW ·½Ê½ ©¦  ºÏ  ¼Æ  ©§\n");
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§ÄÏ¿ª´óÑ§ËÞÉáÍø©¦  %5.2f%%  ©¦  %5.2f%%  ©¦ 100.00%%  ©§\n", (c[1][0]-c[1][1])*100.0/c[1][0],c[1][1]*100.0/c[1][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§ÄÏ¿ª´óÑ§½ÌÓýÍø©¦  %5.2f%%  ©¦  %5.2f%%  ©¦ 100.00%%  ©§\n",(c[2][0]-c[2][1])*100.0/c[2][0],c[2][1]*100.0/c[2][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§Ð£  Íâ  Íø  ¶Î©¦  %5.2f%%  ©¦  %5.2f%%  ©¦ 100.00%%  ©§\n",((c[0][0]-c[1][0]-c[2][0])-(c[0][1]-c[1][1]-c[2][1]))*100.0/(c[0][0]-c[1][0]-c[2][0]),(c[0][1]-c[1][1]-c[2][1])*100.0/(c[0][0]-c[1][0]-c[2][0]));
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§   ×Ü    ¼Æ   ©¦  %5.2f%%  ©¦  %5.2f%%  ©¦ 100.00%%  ©§\n",(c[0][0]-c[0][1])*100.0/c[0][0],c[0][1]*100.0/c[0][0]);
	fprintf(fp,"        ©»©¥©¥©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©¿\n");


	
	fprintf(fp,"[1;36m¡ñ[1;36m°Ù·Ö±È(×ÝÏò)[1;37m\n");
	fprintf(fp,"        ©³©¥©¥©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©Ó©¥©¥©¥©¥©¥©·\n");
	fprintf(fp,"        ©§   À´    Ô´   ©¦Telnet·½Ê½©¦ WWW ·½Ê½ ©¦  ºÏ  ¼Æ  ©§\n");
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§ÄÏ¿ª´óÑ§ËÞÉáÍø©¦  %5.2f%%  ©¦  %5.2f%%  ©¦  %5.2f%%  ©§\n", (c[1][0]-c[1][1])*100.0/(c[0][0]-c[0][1]),c[1][1]*100.0/c[0][1],c[1][0]*100.0/c[0][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§ÄÏ¿ª´óÑ§½ÌÓýÍø©¦  %5.2f%%  ©¦  %5.2f%%  ©¦  %5.2f%%  ©§\n",(c[2][0]-c[2][1])*100.0/(c[0][0]-c[0][1]),c[2][1]*100.0/c[0][1],c[2][0]*100.0/c[0][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§Ð£  Íâ  Íø  ¶Î©¦  %5.2f%%  ©¦  %5.2f%%  ©¦  %5.2f%%  ©§\n",((c[0][0]-c[1][0]-c[2][0])-(c[0][1]-c[1][1]-c[2][1]))*100.0/(c[0][0]-c[0][1]),(c[0][1]-c[1][1]-c[2][1])*100.0/c[0][1],(c[0][0]-c[1][0]-c[2][0])*100.0/c[0][0]);
	fprintf(fp,"        ©Ä©¤©¤©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©à©¤©¤©¤©¤©¤©Ì\n");
	fprintf(fp,"        ©§   ×Ü    ¼Æ   ©¦ 100.00%%  ©¦ 100.00%%  ©¦ 100.00%%  ©§\n");
	fprintf(fp,"        ©»©¥©¥©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©Û©¥©¥©¥©¥©¥©¿\n");

	
	
	fclose(fp);
}


